Revit 2026 API

# UITheme Enumeration

---

The application frame theme.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum UITheme
```
```vb
Public Enumeration UITheme
```
```cpp
public enum class UITheme
```
```fsharp
type UITheme
```

| Member name | Value | Description |
| --- | --- | --- |
| Dark | 0 | Dark. |
| Light | 1 | Light. |

#### Reference

Autodesk.Revit.UI Namespace